{"pageProps":{"slug":"2021-06-11-mengenal-type-coercion-fitur-javascript-yang-bikin-gagal-paham","content":"<blockquote>\n<p>JavaScript adalah sebuah bahasa pemograman yang sangat dinamis, Saking dinamisnya sampai ada anekdot yang mengartikan Javascript adalah Sebuah Bahasa dimana kita berpura - pura Bahagia!</p>\n</blockquote>\n<p>Saya mulai berkenalan dengan bahasa pemrograman pada saat mengenyam bangku kuliah, bahasa pemrograman yang pertama kali saya coba saat itu adalah Pascal dengan menggunakan IDE (<em>Integrated Development Environment</em>) <a href=\"https://id.wikipedia.org/wiki/Turbo_Pascal\">Turbo Pascal</a>. Semester perkuliahan terus berlanjut dan selama itu saya beberapa kali sempat mencicipi macam-macam bahasa pemograman dari <em>C++</em> yang dicoding pakai <em>Notepad++</em>, <em>Java</em> yang di running pakai <em>Eclipse</em>, hingga akhirnya fokus ke arah <em>Website Development</em> dan belajar bahasa pemrograman sejuta umat yaitu <em>PHP</em>.</p>\n<p>Saya agak cukup lama menjadi <em>PHP</em> Developer mungkin sekitar 3-4 tahun, hingga akhirnya tertarik dengan framework javascript <a href=\"https://docs.vuejs.id/v2/guide/\">Vue.js</a> dan menjadi gerbang pengantar saya untuk lebih serius mendalami bahasa pemrograman <em>Javascript</em>. Walaupun pada saat saya menjadi <em>PHP</em> Developer sebenarnya saya sudah cukup familiar dengan <em>Javascript</em> lewat <a href=\"https://jquery.com/\">JQuery</a>, tapi waktu itu mindset saya masih mengganggap bahwa <em>Javascript</em> hanya sekedar bahasa <em>compliment</em> pendamping dari PHP.</p>\n","meta":{"image":"https://res.cloudinary.com/softwaremakassar/image/upload/c_scale,q_auto:eco,w_980/v1623372874/munirapp.github.io/artikel/2021-06-11-mengenal-type-coercion-fitur-javascript-yang-bikin-gagal-paham.webp","title":"Mengenal Type Coercion Javascript yang sering bikin gagal paham","date":"2021-06-11","desc":"JavaScript adalah sebuah bahasa pemograman yang sangat dinamis, Saking dinamisnya sampai ada anekdot yang mengartikan Javascript adalah Sebuah Bahasa dimana kita berpura - pura Bahagia!","author":"Munir AP","slug":"mengenal-type-coercion-fitur-javascript-yang-bikin-gagal-paham"}},"__N_SSG":true}